I didn't apply it (can't merge with a branch specification), but the plan definitely looks good:

```log
# module.eks_node_group_default.aws_eks_node_group.default[0] will be created
  + resource "aws_eks_node_group" "default" {
      + ami_type        = "AL2_x86_64"
      + arn             = (known after apply)
      + cluster_name    = "app-prod-cluster"
      + disk_size       = 20
      + id              = (known after apply)
      + instance_types  = [
          + "t3.medium",
        ]
      + labels          = {
          + "node_type" = "default"
        }
      + node_group_name = "app-prod-workers"
      + node_role_arn   = (known after apply)
      + release_version = (known after apply)
      + resources       = (known after apply)
      + status          = (known after apply)
      + subnet_ids      = [
          + "subnet-xxxyyyzzz",
          + "subnet-xxxyyyzzz",
          + "subnet-xxxyyyzzz",
          + "subnet-xxxyyyzzz",
        ]
      + tags            = {
          + "Attributes"                                    = "workers"
          + "Environment"                                   = "app-stack"
          + "ManagedBy"                                     = "Terraform"
          + "Name"                                          = "app-prod-workers"
          + "Namespace"                                     = "app"
          + "ReleaseStage"                                  = "PROD"
          + "Stage"                                         = "prod"
          + "kubernetes.io/cluster/app-prod-cluster" = "owned"
        }
      + version         = "1.14"

      + scaling_config {
          + desired_size = 3
          + max_size     = 10
          + min_size     = 3
        }
    }
```